books = [{'title': 'Метро 2033', 'author': 'Дмитрий Глуховский', 'year': '2002'},
         {'title': 'Ведьмак', 'author': 'Анджей Сапковский', 'year': '1993'},
         {'title': 'Чиполлино', 'author': 'Джанни Родари', 'year': '1961'},
         {'title': 'Война и мир', 'author': 'Лев Толстой', 'year': '1985'},
         {'title': 'Гарри Поттер и Кубок огня', 'author': 'Дж.К. Роулинг', 'year': '2000'},] #Список с названимями, авторами и годами выпуска популярных любимых книг
for index in range(len(books)):
    print(f"-------------------------Книга №{index + 1}-------------------------")
    print(f"Название: {books[index]['title']}; Автор: {books[index]['author']}")
    print(f"---------------------------{books[index]['year']}---------------------------")
    print()
    print()